---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.TypeSizeNotMatchWithHostError
source: html/8ed29219-9fba-2555-68f1-c4b938a82151.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures.TypeSizeNotMatchWithHostError Property

The [Symbol] does not match the size of the host.

## Syntax (C#)
```csharp
public static FailureDefinitionId TypeSizeNotMatchWithHostError { get; }
```